#+TITLE: Day3
#+PROPERTY: header-args:clojure :session day3 :tangle ../src/day3.clj :results silent :comments org

* Verify that it works for the example

#+begin_src clojure :results replace :tangle no
(count-trees-for-slope (parse-input example-input) [3 1])
#+end_src

#+RESULTS:
: 7

* Get the answer to Part 1

#+begin_src clojure :results replace :tangle no
(count-trees-for-slope
 (parse-input (slurp (io/resource "day3-input.txt")))
 [3 1])
#+end_src

#+RESULTS:
: 289

** Define the slopes to check
#+begin_src clojure
(def slopes-to-check [[1 1] [3 1] [5 1] [7 1] [1 2]])
#+end_src

#+begin_src clojure :results replace :tangle no
(let [input (parse-input example-input)]
  (->> slopes-to-check
       (map (partial count-trees-for-slope input))
       (reduce *)))
#+end_src

#+RESULTS:
: 336

* Get the answer for Part 2
#+begin_src clojure :results replace :tangle no
(let [input (parse-input (slurp (io/resource "day3-input.txt")))]
  (->> slopes-to-check
       (map (partial count-trees-for-slope input))
       (reduce *)))
#+end_src

#+RESULTS:
: 5522401584
